/*
==============================================================================
 ■ 用語辭典設定檔
  http://home.gamer.com.tw/homeindex.php?owner=qootm2
  https://twitter.com/STILILA  
==============================================================================

*/

/*:
 * @plugindesc 用語字典的設定檔
 
@help
//--------------------------------------------------------------------------
// ● 必須插件
//--------------------------------------------------------------------------
本體(放在此插件上面)：
 https://www.dropbox.com/s/dqa0krboh2uxj0f/STLLA_Dictionary.js?dl=0
 
*/

var STILILA = STILILA || {};
if (typeof(STILILA.Dict) == 'undefined') {alert('未安裝STLLA_Dictionary.js'); }
//==============================================================================
// ■ 自定義設置－用語辭典
//==============================================================================
  // 用語設定
  // STILILA.Dict.Help = {
  //   tag1 : {用語1 : [說明1,說明2,說明3...], 用語2 : [說明1,...],...},
  //   tag2 : {...},
  //   tag3 : {...}
  // }
  /*
	說明的結構
	[{說明內容1}, {說明內容2}, {說明內容3}...]
	
	說明內容的結構 
	1.{text:說明文字, y:y軸}   	※文字類，y省略的話為0，文字一般情況下每行高度是36  
	2.{img:圖片名稱, x:x軸, y:y軸, w:圖片寬, h:圖片高}     ※圖片類，圖片讀取img/pictures/裡面的圖。 x, y, w, h可省略，省略時x, y為0，w, h為圖片寬和高。
	
	
	
  */
  
  
  STILILA.Dict.Help = {
    // 世界觀
    '世界觀' : {
		'不知名大陸' : [
			[{text:'一塊面積很大的土地，充滿生機'}]
		], 
		'神' : [
			[{text:'很強'}]
		]
    }, 
    // 人物
    '人物': {
		'艾利克斯' : [
			// \n為換行，注意大部分對話控制符要2個'\'
			[{text:'2k內建主角，代表色\\c[1]藍色\\c[0]\n\n你沒看錯可以支援對話控制符\n＼たーのしー！／'}] 
		], 
		'薩克' : [
			[{text:'2k3內建主角'}]
		],
		'阿爾西斯' : [
			[{text:'XP內建主角'}]
		],
      
		'拉爾夫' : [
			// 階段1說明
			[{text:'VX內建主角，範例的常駐角色\n\n然而MV範例就不見了'}],
			// 階段2說明，有複數個說明時別忘了用逗點隔開
            [{text:'VX內建主角，範例的常駐角色\n\n然而MV範例就不見了\n\n\n\n\n\n\n\n\n\n\n↓下面還有↓\n\n「菲爾莉吃薯」'}] 
		], 
		'菲爾莉' : [
			[{text:'範例萬年解說役，好好感謝她\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n「拉爾夫爆炸吧」'}]
		],          
		'艾力克' : [
			[{text:'VA內建主角，\n有著\\c[8]白色死神\\c[0]的中二稱號'}]
		],  
		'哈洛德' : [
			[{text:'MV內建主角'}]
		],
		'瑞德' : [
			[{text:'MZ內建主角，這是他的照片：'}, {img:'Actor1_1', x:36, y:32}, {text:'如果沒看過現在讓你看看', y:390}]
		]
    }, 
    // 其他
    '其他': {
		'焦糖布丁' : [
			[{text:'\\c[2]軟綿綿甜蜜蜜\\c[0]，好ㄘ'}]
		],
		'巧克力' : [
			[{text:'產自中美洲的甜食，\n菲爾莉每天要吃三個'}]
		],
		'Friends' : [
			[{text:'朋友的英文，複數形\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n＼わーい、你居然發現這裡、すごーい！／'}]
		] 
    }, 
  };

