/*:
 * @plugindesc 道具合成系統－設定檔
 
@help
需要安裝STTLA_Synthesis.js
https://www.dropbox.com/s/qdqub0ti4dsq1kk/STTLA_Synthesis.js?dl=0

@target MZ
@base STTLA_Synthesis
@orderAfter STTLA_Synthesis

@ 中斷tag用

*/
var STILILA = STILILA || {};
STILILA.SYN = STILILA.SYN || {};
//--------------------------------------------------------------------------
// ● 配方設定
//--------------------------------------------------------------------------
//  種類 => 配方內容
// ＜配方參數＞
//    === 必須參數 ===
//   'mi' — 物品素材  {A素材ID=>數量, B素材ID=>數量...}
//   'mw' — 武器素材
//   'ma' — 防具素材
//
//   // === 可省略參數 ===
//   'success' — 成功率
//   'upgrade' — 每次合成後，成功率增加程度
//   'garbage' — 失敗時的產物 (所屬種類的ID)
//   'gold' — 消耗金錢
//   'name' — 配方名稱
//--------------------------------------------------------------------------
STILILA.SYN.List = {
  // ==== 道具
  'item' : {
    // 全恢復劑： 恢復劑x2、強恢復劑x1
    9 : {'mi': {7: 2, 8: 1}, 'mw': {}, 'ma': {}, 'name': '頭好壯壯配方'},
	// 奇蹟水滴
    14 : {'mi': {7: 1, 8: 1, 9: 1, 10: 1, 13: 1}, 'mw': {}, 'ma': {}, 'success': 30, 'upgrade': 5, 'gold': 500},
    // 萬能藥： 解毒劑x3
    15 : {'mi': {13: 3}, 'mw': {}, 'ma': {}},

  },
  // ==== 武器
  'weapon' : {
    // 彎刀： 藥水x3、短劍x2
    3 : {'mi': {7: 3}, 'mw': {1: 2}, 'ma': {}, 'success': 70, 'gold': 300}
  },
  // ==== 防具
  'armor' : {
    // 冒險者之服： 輔助劑x3、布衣x2
    4 : {'mi':{7:3}, 'mw':{}, 'ma':{2: 2}, 'success': 70, 'gold': 300}
  }
};