/*
==============================================================================
 ■ CG回想設定檔
  http://home.gamer.com.tw/homeindex.php?owner=qootm2
  https://twitter.com/STILILA  
==============================================================================
*/
 
/*:
 * @plugindesc CG回想插件的設定檔
  
@help
//--------------------------------------------------------------------------
// ● 必須插件
//--------------------------------------------------------------------------
本體(放在此插件上面)：
 https://www.dropbox.com/s/qd6tmab9m8bqxeq/STLLA_Gallery.js?dl=0
  
*/

var STILILA = STILILA || {};
if (typeof(STILILA.CG) == 'undefined') {alert('未安裝STLLA_Gallery.js') ; window.close();}

//----------------------------------------------
// ● 使用者自定義－－CG資料
//    把要讀取的檔案名稱和CG排版設定在此
//    檔名隨意，預設寫法只是讓使用者清楚格子和差分對應
//    ※ 若要用jpg，需含附檔名
//----------------------------------------------
STILILA.CG.DataSet = [

	// 第0格
	['CG0_0.jpg', 'CG0_1.jpg'],
	// 第1格
	['CG1_0', 'CG1_1', 'CG1_2'],
	// 第2格
	['CG2_0.jpg'],
	// 往下追加...
	
]; 
//----------------------------------------------
// ● 使用者自定義－－CG註解
//    每格CG分為開啟前、開啟後
//----------------------------------------------
STILILA.CG.TextSet = [
	// 第0格
	[
		['這是第0格CG，未開'],  //第0格未開放的說明
		['這是第0格CG，已開']   //第0格已開放的說明
	],  
	// 第1格
	[
		['一行說明可輸入21個全型字', '共可輸入4行', '這是第3行', '這是第4行'], // 第1格未開放的說明
		['一行說明可輸入21個全型字', '共可輸入4行', '這是第3行', '這是第4行']  // 第1格已開放的說明
	],  
	// 第2格
	[
		['說明不輸入也可以', '執行不正確的部分不會顯示'], // 未開放的說明
		[] // 已開放的說明
	],
	// 往下追加...
	
	
];